# DATA CLEANING AND PREPERATION

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [5]:
data.dropna()     #dropna will leave null values

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [44]:
data=pd.DataFrame([[1,NA,3],
                  [NA,2,9],
                  [8,4,NA]]
                 )

data

     0    1    2
0  1.0  NaN  3.0
1  NaN  2.0  9.0
2  8.0  4.0  NaN

In [45]:
data.index=['a','b','c']

In [46]:
data.columns=['anie','abs','tart']

In [47]:
data

   anie  abs  tart
a   1.0  NaN   3.0
b   NaN  2.0   9.0
c   8.0  4.0   NaN

In [48]:
data.NaN=2

In [49]:
data

   anie  abs  tart
a   1.0  NaN   3.0
b   NaN  2.0   9.0
c   8.0  4.0   NaN

In [50]:
cleaned=data.dropna()

In [51]:
cleaned

Empty DataFrame
Columns: [anie, abs, tart]
Index: []

In [52]:
data.dropna(how='all')

   anie  abs  tart
a   1.0  NaN   3.0
b   NaN  2.0   9.0
c   8.0  4.0   NaN

In [53]:
df=pd.DataFrame(np.random.rand(7,3))
df

          0         1         2
0  0.190509  0.457647  0.812450
1  0.228644  0.952634  0.018425
2  0.999686  0.592578  0.832641
3  0.127717  0.250433  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [54]:
df.iloc[:4,1] = NA

In [41]:
df

          0         1         2
0  0.861720       NaN       NaN
1  0.830483       NaN       NaN
2  0.817836       NaN       NaN
3  0.691013       NaN       NaN
4  0.703978  0.764677  0.712977
5  0.061195  0.717691  0.290076
6  0.996193  0.712765  0.484267

In [55]:
df.dropna()

          0         1         2
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [56]:
df.fillna(5)

          0         1         2
0  0.190509  5.000000  0.812450
1  0.228644  5.000000  0.018425
2  0.999686  5.000000  0.832641
3  0.127717  5.000000  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [57]:
np.mean(df)

0    0.401720
1    0.501977
2    0.559922
dtype: float64

In [58]:
df.fillna(0, inplace=True)

In [59]:
df

          0         1         2
0  0.190509  0.000000  0.812450
1  0.228644  0.000000  0.018425
2  0.999686  0.000000  0.832641
3  0.127717  0.000000  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [60]:
df.fillna(0,inplace=False)

          0         1         2
0  0.190509  0.000000  0.812450
1  0.228644  0.000000  0.018425
2  0.999686  0.000000  0.832641
3  0.127717  0.000000  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [61]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [62]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [63]:
#dropduplicate based on specific column or columns
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

difference between join and merge

# HANDLING MISSING DATA

In [69]:
string_data = pd.Series([np.nan,'jhu','jhbh'])
string_data

0     NaN
1     jhu
2    jhbh
dtype: object

In [70]:
string_data.isnull()

0     True
1    False
2    False
dtype: bool

In [71]:
string_data.isna()

0     True
1    False
2    False
dtype: bool

In [72]:
string_data.notnull()

0    False
1     True
2     True
dtype: bool

In [74]:
string_data.notna()

0    False
1     True
2     True
dtype: bool

In [75]:
string_data[string_data.isnull()]

0    NaN
dtype: object

In [76]:
string_data[string_data.isna()]

0    NaN
dtype: object

In [77]:
string_data[string_data.isnull()] | string_data[string_data.isna()]

0    False
dtype: bool

In [78]:
string_data[string_data.notna()]

1     jhu
2    jhbh
dtype: object

In [80]:
string_data[string_data.notnull()]

1     jhu
2    jhbh
dtype: object

In [81]:
string_data[string_data.isna()]

0    NaN
dtype: object

In [87]:
string_data[0]=None

In [88]:
string_data

0    None
1     jhu
2    jhbh
dtype: object

dropna
fillna

In [89]:
string_data

0    None
1     jhu
2    jhbh
dtype: object

In [91]:
string_data.duplicated()

0    False
1    False
2    False
dtype: bool

In [92]:
string_data.dropna()

1     jhu
2    jhbh
dtype: object

string_data.dropna(any)

if any row has nan value then dropna removes the whole row and retrieves the only row where there isnt any nan

if column wise remove then axis=1

In [98]:
df.dropna(how='all')

          0         1         2
0  0.190509  0.000000  0.812450
1  0.228644  0.000000  0.018425
2  0.999686  0.000000  0.832641
3  0.127717  0.000000  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [96]:
df.dropna(how='any')

          0         1         2
0  0.190509  0.000000  0.812450
1  0.228644  0.000000  0.018425
2  0.999686  0.000000  0.832641
3  0.127717  0.000000  0.432245
4  0.257302  0.548272  0.543688
5  0.423043  0.626747  0.284194
6  0.585139  0.330911  0.995814

In [143]:
df= pd.DataFrame(np.random.rand(4,3))
df

          0         1         2
0  0.395792  0.440792  0.361594
1  0.680028  0.040237  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [144]:
df

          0         1         2
0  0.395792  0.440792  0.361594
1  0.680028  0.040237  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [145]:
df.iloc[:2,1]=NA        #iloc for slicing

In [146]:
df

          0         1         2
0  0.395792       NaN  0.361594
1  0.680028       NaN  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [147]:
df.dropna()

          0         1         2
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [148]:
df.dropna(thresh=1)

          0         1         2
0  0.395792       NaN  0.361594
1  0.680028       NaN  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [149]:
df

          0         1         2
0  0.395792       NaN  0.361594
1  0.680028       NaN  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [150]:
df[(df[1].notnull())]

          0         1         2
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [151]:
df.fillna(df.mean())

          0         1         2
0  0.395792  0.631614  0.361594
1  0.680028  0.631614  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [153]:
df.fillna(df.mean(),inplace=True)   #for changing physical data

In [154]:
df

          0         1         2
0  0.395792  0.631614  0.361594
1  0.680028  0.631614  0.403852
2  0.404481  0.680000  0.238870
3  0.632792  0.583228  0.532121

In [155]:
df=pd.DataFrame(np.random.randn(6,3))

In [156]:
df

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827 -1.355168 -2.028891
3 -1.234999  1.903235  1.201875
4  1.449025 -0.042171  0.561504
5  1.471625  0.819045 -1.326410

In [164]:
df.iloc[2:-1,1] = None
df.iloc[4:-1, 2]=None

In [165]:
df

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827       NaN -2.028891
3 -1.234999       NaN  1.201875
4  1.449025       NaN       NaN
5  1.471625  0.819045       NaN

bfill  backward fill
ffill  forward fill

In [167]:
df.fillna(method='ffill')

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827  0.459365 -2.028891
3 -1.234999  0.459365  1.201875
4  1.449025  0.459365  1.201875
5  1.471625  0.819045  1.201875

In [169]:
df.fillna(method='ffill',axis=1)

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827  0.811827 -2.028891
3 -1.234999 -1.234999  1.201875
4  1.449025  1.449025  1.449025
5  1.471625  0.819045  0.819045

In [170]:
df.fillna(method='bfill',limit=2)  #will fill in only 2

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827       NaN -2.028891
3 -1.234999  0.819045  1.201875
4  1.449025  0.819045       NaN
5  1.471625  0.819045       NaN

In [171]:
df.fillna(2)       # 2 is the value

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827  2.000000 -2.028891
3 -1.234999  2.000000  1.201875
4  1.449025  2.000000  2.000000
5  1.471625  0.819045  2.000000

# DATA TRANFORMATION

Removing duplicates

In [172]:
df

          0         1         2
0  1.351574  0.332578 -0.377539
1 -0.731107  0.459365  0.211597
2  0.811827       NaN -2.028891
3 -1.234999       NaN  1.201875
4  1.449025       NaN       NaN
5  1.471625  0.819045       NaN

In [174]:
df[1].isna().sum()

3

In [175]:
df[1].isna().sum()/ len(df)

0.5

In [176]:
data = pd.DataFrame({
    'k1':['one','two'] *3 + ['two'],
    'k2':[1,1,2,3,3,4,4]
})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [178]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [179]:
data[data.duplicated()]

    k1  k2
6  two   4

In [180]:
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [182]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

ltd=long today
wtd=week today

In [183]:
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [184]:
data.drop_duplicates(subset=["k1",'k2'])       #for more than one column tehn in list

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [185]:
data['v1']=range(7)

In [186]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [187]:
data.drop_duplicates(subset=["k1",'k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

# from book animal meat function

# REPLACING VALUES

In [188]:
data = pd.Series([1,-2,3,4,5,6])
data

0    1
1   -2
2    3
3    4
4    5
5    6
dtype: int64

In [192]:
data.replace(-2,np.nan)

0    1.0
1    NaN
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [197]:
data.replace([-2,1],[np.nan,0]) #list passing

0    0.0
1    NaN
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [ ]:
data.replace([-2,1],[np.nan,0]) #dictionary passing

# RENAMING AXIS INDEXING

In [ ]:
data = pd.DataFrame(np.arange(4,3))......................

# DISCRETIZATION AND BINNING

In [203]:
ages = [20,30,40,50,70,89,94,96,98,99,990,999]
slab = [18,25,40,6060,120]

cat = pd.cut(ages,slab)
cat

ValueError: bins must increase monotonically.

In [ ]:
cut, qcut(% according)

# DETECTING AND FILTERING OUTLIERS

In [205]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005078     0.033478     0.043945    -0.031956
std       0.997105     1.023544     1.015027     0.997385
min      -3.039672    -2.856580    -2.859976    -3.461671
25%      -0.662395    -0.685116    -0.635928    -0.705402
50%      -0.012207     0.047718     0.050722    -0.035644
75%       0.708642     0.707969     0.737379     0.636349
max       3.328524     2.947997     3.426145     3.360835

50 to 70 is the best data for model training

In [206]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
78   1.679836 -2.061928 -0.029283  3.153779
101 -3.039672  0.347552 -0.094552  0.739048
158  3.328524  0.211502  0.452287  1.053512
470 -0.182466  1.164550 -0.438757 -3.461671
765 -1.962706 -0.292842 -1.741370 -3.032193
785  3.195849 -0.841922  0.441360 -0.862037
810 -0.985298  1.766697  3.426145  1.295876
864  1.122968 -1.419641 -0.904164  3.360835

In [207]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0 -1.0 -1.0
4  1.0  1.0 -1.0  1.0

# PERMUTATION AND RANDOM SAMPLING

In [211]:
df= pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [212]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [213]:
sampler = np.random.permutation(5)

In [214]:
sampler

array([3, 2, 1, 4, 0])

In [215]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

# computing indicator / dummy values

In [220]:
a=pd.DataFrame({"key":['a','a','b','c','d','e']})

a

  key
0   a
1   a
2   b
3   c
4   d
5   e

In [221]:
pd.get_dummies(a.key)

   a  b  c  d  e
0  1  0  0  0  0
1  1  0  0  0  0
2  0  1  0  0  0
3  0  0  1  0  0
4  0  0  0  1  0
5  0  0  0  0  1